RVeips/ARM-Cortex-Network-Test/CortexNetworkTestApp/src/_config/lwip/lwiplib_tm4c.cpp
    //    Enable all MII related pins
    //
    // Enable Peripheral Clocks
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOK);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOM);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOP);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOQ);
    // Configure the GPIO Pin Mux for PP0
    // for EN0INTRN
    MAP_GPIOPinConfigure(GPIO_PP0_EN0INTRN);
    GPIOPinTypeEthernetMII(GPIO_PORTP_BASE, GPIO_PIN_0);
    // Configure the GPIO Pin Mux for PK4
    // for EN0RXD3
    MAP_GPIOPinConfigure(GPIO_PK4_EN0RXD3);
    GPIOPinTypeEthernetMII(GPIO_PORTK_BASE, GPIO_PIN_4);
    // Configure the GPIO Pin Mux for PK6
    // for EN0TXD2
    MAP_GPIOPinConfigure(GPIO_PK6_EN0TXD2);
    GPIOPinTypeEthernetMII(GPIO_PORTK_BASE, GPIO_PIN_6);
    // Configure the GPIO Pin Mux for PG5
    // for EN0TXD1
    MAP_GPIOPinConfigure(GPIO_PG5_EN0TXD1);
    GPIOPinTypeEthernetMII(GPIO_PORTG_BASE, GPIO_PIN_5);
    // Configure the GPIO Pin Mux for PA6
    // for EN0RXCK
    MAP_GPIOPinConfigure(GPIO_PA6_EN0RXCK);
    GPIOPinTypeEthernetMII(GPIO_PORTA_BASE, GPIO_PIN_6);
    // Configure the GPIO Pin Mux for PG7
    // for EN0RXDV
    MAP_GPIOPinConfigure(GPIO_PG7_EN0RXDV);
    GPIOPinTypeEthernetMII(GPIO_PORTG_BASE, GPIO_PIN_7);
    // Configure the GPIO Pin Mux for PG3
    // for EN0TXEN
    MAP_GPIOPinConfigure(GPIO_PG3_EN0TXEN);
    GPIOPinTypeEthernetMII(GPIO_PORTG_BASE, GPIO_PIN_3);
    // Configure the GPIO Pin Mux for PQ5
    // for EN0RXD0
    MAP_GPIOPinConfigure(GPIO_PQ5_EN0RXD0);
    GPIOPinTypeEthernetMII(GPIO_PORTQ_BASE, GPIO_PIN_5);
    // Configure the GPIO Pin Mux for PM6
    // for EN0CRS
    MAP_GPIOPinConfigure(GPIO_PM6_EN0CRS);
    GPIOPinTypeEthernetMII(GPIO_PORTM_BASE, GPIO_PIN_6);
    // Configure the GPIO Pin Mux for PK5
    // for EN0RXD2
    MAP_GPIOPinConfigure(GPIO_PK5_EN0RXD2);
    GPIOPinTypeEthernetMII(GPIO_PORTK_BASE, GPIO_PIN_5);
    // Configure the GPIO Pin Mux for PG4
    // for EN0TXD0
    MAP_GPIOPinConfigure(GPIO_PG4_EN0TXD0);
    GPIOPinTypeEthernetMII(GPIO_PORTG_BASE, GPIO_PIN_4);
    // Configure the GPIO Pin Mux for PG2
    // for EN0TXCK
    MAP_GPIOPinConfigure(GPIO_PG2_EN0TXCK);
    GPIOPinTypeEthernetMII(GPIO_PORTG_BASE, GPIO_PIN_2);
    // Configure the GPIO Pin Mux for PQ6
    // for EN0RXD1
    MAP_GPIOPinConfigure(GPIO_PQ6_EN0RXD1);
    GPIOPinTypeEthernetMII(GPIO_PORTQ_BASE, GPIO_PIN_6);
    // Configure the GPIO Pin Mux for PK7
    // for EN0TXD3
    MAP_GPIOPinConfigure(GPIO_PK7_EN0TXD3);
    GPIOPinTypeEthernetMII(GPIO_PORTK_BASE, GPIO_PIN_7);
    // Configure the GPIO Pin Mux for PM7
    // for EN0COL
    MAP_GPIOPinConfigure(GPIO_PM7_EN0COL);
    GPIOPinTypeEthernetMII(GPIO_PORTM_BASE, GPIO_PIN_7);

#endif

    //
    // Configure for use with whichever PHY the user requires.
    //
    EMACPHYConfigSet(EMAC0_BASE, EMAC_PHY_CONFIG);

    //
    // Initialize the MAC and set the DMA mode.
    //
    MAP_EMACInit(EMAC0_BASE, ui32SysClkHz, EMAC_BCONFIG_MIXED_BURST | EMAC_BCONFIG_PRIORITY_FIXED, 4, 4, 0);

    //
    // Set MAC configuration options.
    //
    MAP_EMACConfigSet(
        EMAC0_BASE,
        (EMAC_CONFIG_FULL_DUPLEX | EMAC_CONFIG_CHECKSUM_OFFLOAD | EMAC_CONFIG_7BYTE_PREAMBLE | EMAC_CONFIG_IF_GAP_96BITS |
         EMAC_CONFIG_USE_MACADDR0 | EMAC_CONFIG_SA_FROM_DESCRIPTOR | EMAC_CONFIG_BO_LIMIT_1024),
        (EMAC_MODE_RX_STORE_FORWARD | EMAC_MODE_TX_STORE_FORWARD | EMAC_MODE_TX_THRESHOLD_64_BYTES | EMAC_MODE_RX_THRESHOLD_64_BYTES),
        0);

    //
    // Program the hardware with its MAC address (for filtering).
    //
    MAP_EMACAddrSet(EMAC0_BASE, 0, (uint8_t *)pui8MAC);

    //
    // Save the network configuration for later use by the private
    // initialization.
    //
    g_ui32IPMode  = ui32IPMode;
    g_ui32IPAddr  = ui32IPAddr;
    g_ui32NetMask = ui32NetMask;
    g_ui32GWAddr  = ui32GWAddr;

    //
    // Initialize lwIP.  The remainder of initialization is done immediately if
    // not using a RTOS and it is deferred to the TCP/IP thread's context if
    // using a RTOS.
    //
#if NO_SYS
    lwIPPrivateInit(0);
#else
    tcpip_init(lwIPPrivateInit, 0);
#endif
}

//*****************************************************************************
//
//! Registers an interrupt callback function to handle the IEEE-1588 timer.
//!
//! \param pfnTimerFunc points to a function which is called whenever the
//! Ethernet MAC reports an interrupt relating to the IEEE-1588 hardware timer.
//!
//! This function allows an application to register a handler for all
//! interrupts generated by the IEEE-1588 hardware timer in the Ethernet MAC.
//! To allow minimal latency timer handling, the callback function provided
//! will be called in interrupt context, regardless of whether or not lwIP is
//! configured to operate with an RTOS.  In an RTOS environment, the callback
//! function is responsible for ensuring that all processing it performs is
//! compatible with the low level interrupt context it is called in.
//!
//! The callback function takes two parameters.  The first is the base address
//! of the MAC reporting the timer interrupt and the second is the timer
//! interrupt status as reported by EMACTimestampIntStatus().  Note that
//! EMACTimestampIntStatus() causes the timer interrupt sources to be cleared
//! so the application should not call EMACTimestampIntStatus() within the
//! handler.
//!
//! \return None.
//
//*****************************************************************************
void lwIPTimerCallbackRegister(tHardwareTimerHandler pfnTimerFunc) {
    //
    // Remember the callback function address passed.
    //
    g_pfnTimerHandler = pfnTimerFunc;
}

//*****************************************************************************
//
//! Handles periodic timer events for the lwIP TCP/IP stack.
//!
//! \param ui32TimeMS is the incremental time for this periodic interrupt.
//!
//! This function will update the local timer by the value in \e ui32TimeMS.
//! If the system is configured for use without an RTOS, an Ethernet interrupt
//! will be triggered to allow the lwIP periodic timers to be serviced in the
//! Ethernet interrupt.
//!
//! \return None.
//
//*****************************************************************************
#if NO_SYS
void lwIPTimer(uint64_t ui32TimeMS) {
    //
    // Increment the lwIP Ethernet timer.
    //
    g_ui32LocalTimer = ui32TimeMS;

    //
    // Generate an Ethernet interrupt.  This will perform the actual work
    // of checking the lwIP timers and taking the appropriate actions.  This is
    // needed since lwIP is not re-entrant, and this allows all lwIP calls to
    // be placed inside the Ethernet interrupt handler ensuring that all calls
    // into lwIP are coming from the same context, preventing any reentrancy
    // issues.  Putting all the lwIP calls in the Ethernet interrupt handler
    // avoids the use of mutexes to avoid re-entering lwIP.
    //

    sys_check_timeouts();

